smartgauges/canbox/vw_nc03/fw/nuc131bsp/Library/Device/Nuvoton/NUC131/Include/NUC131.h
#define BPWM_WGCTL1_CMPUCTL5_Pos         (10)                                               /*!< BPWM_T::WGCTL1: CMPUCTL5 Position          */
#define BPWM_WGCTL1_CMPUCTL5_Msk         (0x3ul << BPWM_WGCTL1_CMPUCTL5_Pos)                /*!< BPWM_T::WGCTL1: CMPUCTL5 Mask              */

#define BPWM_WGCTL1_CMPDCTLn_Pos         (16)                                               /*!< BPWM_T::WGCTL1: CMPDCTLn Position          */
#define BPWM_WGCTL1_CMPDCTLn_Msk         (0xffful << BPWM_WGCTL1_CMPDCTLn_Pos)              /*!< BPWM_T::WGCTL1: CMPDCTLn Mask              */

#define BPWM_WGCTL1_CMPDCTL0_Pos         (16)                                               /*!< BPWM_T::WGCTL1: CMPDCTL0 Position          */
#define BPWM_WGCTL1_CMPDCTL0_Msk         (0x3ul << BPWM_WGCTL1_CMPDCTL0_Pos)                /*!< BPWM_T::WGCTL1: CMPDCTL0 Mask              */

#define BPWM_WGCTL1_CMPDCTL1_Pos         (18)                                               /*!< BPWM_T::WGCTL1: CMPDCTL1 Position          */
#define BPWM_WGCTL1_CMPDCTL1_Msk         (0x3ul << BPWM_WGCTL1_CMPDCTL1_Pos)                /*!< BPWM_T::WGCTL1: CMPDCTL1 Mask              */

#define BPWM_WGCTL1_CMPDCTL2_Pos         (20)                                               /*!< BPWM_T::WGCTL1: CMPDCTL2 Position          */
#define BPWM_WGCTL1_CMPDCTL2_Msk         (0x3ul << BPWM_WGCTL1_CMPDCTL2_Pos)                /*!< BPWM_T::WGCTL1: CMPDCTL2 Mask              */

#define BPWM_WGCTL1_CMPDCTL3_Pos         (22)                                               /*!< BPWM_T::WGCTL1: CMPDCTL3 Position          */
#define BPWM_WGCTL1_CMPDCTL3_Msk         (0x3ul << BPWM_WGCTL1_CMPDCTL3_Pos)                /*!< BPWM_T::WGCTL1: CMPDCTL3 Mask              */

#define BPWM_WGCTL1_CMPDCTL4_Pos         (24)                                               /*!< BPWM_T::WGCTL1: CMPDCTL4 Position          */
#define BPWM_WGCTL1_CMPDCTL4_Msk         (0x3ul << BPWM_WGCTL1_CMPDCTL4_Pos)                /*!< BPWM_T::WGCTL1: CMPDCTL4 Mask              */

#define BPWM_WGCTL1_CMPDCTL5_Pos         (26)                                               /*!< BPWM_T::WGCTL1: CMPDCTL5 Position          */
#define BPWM_WGCTL1_CMPDCTL5_Msk         (0x3ul << BPWM_WGCTL1_CMPDCTL5_Pos)                /*!< BPWM_T::WGCTL1: CMPDCTL5 Mask              */

#define BPWM_MSKEN_MSKENn_Pos            (0)                                                /*!< BPWM_T::MSKEN: MSKENn Position             */
#define BPWM_MSKEN_MSKENn_Msk            (0x3ful << BPWM_MSKEN_MSKENn_Pos)                  /*!< BPWM_T::MSKEN: MSKENn Mask                 */

#define BPWM_MSKEN_MSKEN0_Pos            (0)                                                /*!< BPWM_T::MSKEN: MSKEN0 Position             */
#define BPWM_MSKEN_MSKEN0_Msk            (0x1ul << BPWM_MSKEN_MSKEN0_Pos)                   /*!< BPWM_T::MSKEN: MSKEN0 Mask                 */

#define BPWM_MSKEN_MSKEN1_Pos            (1)                                                /*!< BPWM_T::MSKEN: MSKEN1 Position             */
#define BPWM_MSKEN_MSKEN1_Msk            (0x1ul << BPWM_MSKEN_MSKEN1_Pos)                   /*!< BPWM_T::MSKEN: MSKEN1 Mask                 */

#define BPWM_MSKEN_MSKEN2_Pos            (2)                                                /*!< BPWM_T::MSKEN: MSKEN2 Position             */
#define BPWM_MSKEN_MSKEN2_Msk            (0x1ul << BPWM_MSKEN_MSKEN2_Pos)                   /*!< BPWM_T::MSKEN: MSKEN2 Mask                 */

#define BPWM_MSKEN_MSKEN3_Pos            (3)                                                /*!< BPWM_T::MSKEN: MSKEN3 Position             */
#define BPWM_MSKEN_MSKEN3_Msk            (0x1ul << BPWM_MSKEN_MSKEN3_Pos)                   /*!< BPWM_T::MSKEN: MSKEN3 Mask                 */

#define BPWM_MSKEN_MSKEN4_Pos            (4)                                                /*!< BPWM_T::MSKEN: MSKEN4 Position             */
#define BPWM_MSKEN_MSKEN4_Msk            (0x1ul << BPWM_MSKEN_MSKEN4_Pos)                   /*!< BPWM_T::MSKEN: MSKEN4 Mask                 */

#define BPWM_MSKEN_MSKEN5_Pos            (5)                                                /*!< BPWM_T::MSKEN: MSKEN5 Position             */
#define BPWM_MSKEN_MSKEN5_Msk            (0x1ul << BPWM_MSKEN_MSKEN5_Pos)                   /*!< BPWM_T::MSKEN: MSKEN5 Mask                 */

#define BPWM_MSK_MSKDATn_Pos             (0)                                                /*!< BPWM_T::MSK: MSKDATn Position              */
#define BPWM_MSK_MSKDATn_Msk             (0x3ful << BPWM_MSK_MSKDATn_Pos)                   /*!< BPWM_T::MSK: MSKDATn Mask                  */

#define BPWM_MSK_MSKDAT0_Pos             (0)                                                /*!< BPWM_T::MSK: MSKDAT0 Position              */
#define BPWM_MSK_MSKDAT0_Msk             (0x1ul << BPWM_MSK_MSKDAT0_Pos)                    /*!< BPWM_T::MSK: MSKDAT0 Mask                  */

#define BPWM_MSK_MSKDAT1_Pos             (1)                                                /*!< BPWM_T::MSK: MSKDAT1 Position              */
#define BPWM_MSK_MSKDAT1_Msk             (0x1ul << BPWM_MSK_MSKDAT1_Pos)                    /*!< BPWM_T::MSK: MSKDAT1 Mask                  */

#define BPWM_MSK_MSKDAT2_Pos             (2)                                                /*!< BPWM_T::MSK: MSKDAT2 Position              */
#define BPWM_MSK_MSKDAT2_Msk             (0x1ul << BPWM_MSK_MSKDAT2_Pos)                    /*!< BPWM_T::MSK: MSKDAT2 Mask                  */

#define BPWM_MSK_MSKDAT3_Pos             (3)                                                /*!< BPWM_T::MSK: MSKDAT3 Position              */
#define BPWM_MSK_MSKDAT3_Msk             (0x1ul << BPWM_MSK_MSKDAT3_Pos)                    /*!< BPWM_T::MSK: MSKDAT3 Mask                  */

#define BPWM_MSK_MSKDAT4_Pos             (4)                                                /*!< BPWM_T::MSK: MSKDAT4 Position              */
#define BPWM_MSK_MSKDAT4_Msk             (0x1ul << BPWM_MSK_MSKDAT4_Pos)                    /*!< BPWM_T::MSK: MSKDAT4 Mask                  */

